[
  {
    "id": "1",
    "title": "Dying Light 2. Deluxe Edition",
    "description": "Use your agility and combat skills to survive, and change the fate of The City. Upgrade your Dying Light 2 Standard Edition to get the Deluxe content.",
    "price": 80,
    "stock": "5",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/zbjM3Ni.png"
  },
  {
    "id": "2",
    "title": "Elden Ring",
    "description": "THE NEW FANTASY ACTION RPG. Rise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between.",
    "price": 60,
    "stock": "7",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/5tY20pw.png"
  },
  {
    "id": "3",
    "title": "Grand Theft Auto V",
    "description": "Grand Theft Auto V and GTA Online — now upgraded for PlayStation 5 and Xbox Series X|S with stunning visuals, faster loading, and more — delivering the action-packed, blockbuster Story Mode adventure and the dynamic, ever-evolving online world of GTA...",
    "price": 60,
    "stock": "5",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/wHiX52a.png"
  },
  {
    "id": "4",
    "title": "Super Mario 3D All Stars",
    "description": "Play three of Mario's greatest 3D platforming adventures—all in one package! Play three iconic games at home or on the go—all in one package on the Nintendo Switch system! Jump into paintings in Super Mario 64, clean up paint-like goop in Super Mario Sunshine, and fly from planet to planet in Super Mario Galaxy.",
    "price": 70,
    "stock": "2",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/WT7ahEp.png"
  },
  {
    "id": "5",
    "title": "Super Mario 3D World + Bowser's Fury",
    "description": "Pounce and climb through dozens of colorful courses! Multiply the fun by teaming up with or competing against friends locally** or online*** to reach each stage’s goal. Work together to explore and uncover collectibles, or compete for the crown by earning the highest score, making for a friendly frenzy!",
    "price": 50,
    "stock": "9",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/6r9fYzL.png"
  },
  {
    "id": "6",
    "title": "New Super Mario Bros. U Deluxe",
    "description": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends* as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!",
    "price": 40,
    "stock": "8",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/eUIVDSH.png"
  },
  {
    "id": "7",
    "title": "Mario Kart 8 Deluxe",
    "description": "Hit the road with the definitive version of Mario Kart 8 and play anytime, anywhere! Race your friends or battle them in a revised battle mode on new and returning battle courses. Play locally in up to 4-player multiplayer in 1080p while playing in TV Mode.",
    "price": 60,
    "stock": "6",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/gI3kPh3.png"
  },
  {
    "id": "8",
    "title": "Super Mario Maker 2",
    "description": "Mario fans of the world, unite! Now you can play, create, and share the side-scrolling Super Mario courses of your dreams in the Super Mario Maker 2 game, available exclusively on the Nintendo Switch system! Dive into the single-player Story Mode and play built-in courses to rebuild Princess Peach's castle. Make your own courses, alone or together.",
    "price": 60,
    "stock": "11",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/4Q4PAuq.png"
  },
  {
    "id": "9",
    "title": "Marvel's Spider-Man: Miles Morales",
    "description": "Experience the rise of Miles Morales as the new hero masters incredible, explosive new powers to become his own Spider-Man. In the latest adventure in the Marvel’s Spider-Man universe, teenager Miles Morales is adjusting to his new home while following in the footsteps of his mentor, Peter Parker, as a new Spider-Man.",
    "price": 60,
    "stock": "9",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/PX93nFr.png"
  },
  {
    "id": "10",
    "title": "Persona 5 Royal",
    "description": "Wear the mask. Reveal your truth. Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona®! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona®5 Royal is packed with new characters, story depth, new locations to explore, & a new grappling hook mechanic for access to new areas.",
    "price": 60,
    "stock": "7",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/22TVchi.png"
  },
  {
    "id": "11",
    "title": "Super Smash Bros. Ultimate",
    "description": "Gaming icons clash in the ultimate brawl you can play anytime, anywhere! Smash rivals off the stage as new characters Simon Belmont and King K. Rool join Inkling, Ridley, and every fighter in Super Smash Bros. history. Enjoy enhanced speed and combat at new stages based on the Castlevania series, Super Mario Odyssey, and more!",
    "price": 70,
    "stock": "12",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/BGzwnV7.png"
  },
  {
    "id": "12",
    "title": "Skullgirls 2nd Encore",
    "description": "The ultimate Skullgirls experience: Featuring 14 hand-animated characters, fully voiced story mode, countless palettes, and unparalleled GGPO-based multiplayer netcode.",
    "price": 30,
    "stock": "12",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/DjqzS56.png"
  },
  {
    "id": "13",
    "title": "PS5 HD Camera",
    "description": "Put yourself at the centre of your gameplay sharing with the HD camera for PS5 consoles. Broadcast yourself picture-in-picture4 in 1080p, crop or remove your background and find the perfect angle with the built-in stand.",
    "price": 25,
    "stock": "16",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/GtdsFQE.png"
  },
  {
    "id": "14",
    "title": "PULSE 3D Wireless Headset",
    "description": "Discover a headset fine-tuned for 3D Audio on PS5 consoles2 and with 7.1 virtual surround sound support on PS4. Offering up to 12 hours of wireless play and dual noise-cancelling microphones, you can keep the party chat flowing with crystal-clear voice capture.",
    "price": 50,
    "stock": "11",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/tisXNIH.png"
  },
  {
    "id": "15",
    "title": "PS5 Dualsense Controller",
    "description": "Discover a deeper, highly immersive gaming experience with the innovative PS5 controller, featuring haptic feedback2 and dynamic trigger effects2, and a built-in microphone, all integrated into a comfortable design.",
    "price": 70,
    "stock": "15",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/TXD8xOU.png"
  },
  {
    "id": "16",
    "title": "PS4 Dualshock Controller",
    "description": "Take controller of your PS4 games with the iconic DUALSHOCK 4 wireless controller, featuring responsive triggers, textured grips and a host of features to bring you closer to your games.",
    "price": 60,
    "stock": "12",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/PQDH8Sp.png"
  },
  {
    "id": "17",
    "title": "GameCube Controller Adapter",
    "description": "This adapter allows Super Smash Bros. Ultimate to be played with GameCube controllers. Up to four GameCube controllers can be used with a single adapter.",
    "price": 70,
    "stock": "8",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/4JH804n.png"
  },
  {
    "id": "18",
    "title": "GameCube Controller Smash Edition",
    "description": "Keep the memories alive with the Super Smash Bros. Ultimate Edition GameCube Controller. The nostalgic design will remind many Nintendo fans of the good old days. Show off your loyalty and play your favorite titles the way you know how!",
    "price": 20,
    "stock": "16",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/VLCN6xs.png"
  },
  {
    "id": "20",
    "title": "Joy-Con Charging Grip",
    "description": "Create a grip-style controller simply by attaching a Joy-Con (L) and Joy-Con (R). You can use a Nintendo Switch AC adapter or the included USB charging cable to charge your Joy-Con controllers as you play, freeing you from the worry of running out of power.",
    "price": 20,
    "stock": "14",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/N64rooq.png"
  },
  {
    "id": "21",
    "title": "Nintendo Switch Pro Controller",
    "description": "A wireless controller with easy-to-hold grips to make gaming in TV Mode or Tabletop Mode more comfortable over longer periods.",
    "price": 60,
    "stock": "20",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/wZUkpR9.png"
  },
  {
    "id": "22",
    "title": "Microsoft Kinect for Xbox",
    "description": "Command your Xbox and TV with your voice, make Skype calls in HD, and play games where you are the controller. Be recognized and signed-in automatically, and use your voice to find your favorite entertainment, snap apps, switch instantly and start recording game clips—all without lifting a finger.",
    "price": 20,
    "stock": "20",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/GtdsFQE.png"
  },
  {
    "id": "23",
    "title": "Xbox One Wireless Controller",
    "description": "Experience the modernized design of the Xbox Wireless Controller, featuring sculpted surfaces and refined geometry for enhanced comfort during gameplay. Play wirelessly or use the included 9’ USB-C cable for a wired gaming experience.",
    "price": 60,
    "stock": "20",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/Qp53dTB.png"
  },
  {
    "id": "24",
    "title": "Xbox series X Wireless Controller",
    "description": "Experience the Xbox Elite Wireless Controller Series 2 featuring adjustable-tension thumbsticks, wrap-around rubberized grip, and shorter hair trigger locks. Experience limitless customization with interchangeable components and exclusive button mapping options in the Xbox Accessories app. ",
    "price": 70,
    "stock": "20",
    "category": "accessories",
    "pictureUrl": "https://i.imgur.com/64ks5O0.png"
  },
  {
    "id": "25",
    "title": "PlayStation 4",
    "description": "Store your games, apps, screenshots and videos with up to 1TB storage inside the PS4 console – slimmer and lighter than the original PS4 model and available in Jet Black and more colors.",
    "price": 300,
    "stock": "5",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/Y3mQ3XB.png"
  },
  {
    "id": "26",
    "title": "PlayStation 4 Pro",
    "description": "The most advanced PlayStation system ever. PS4 Pro is designed to take your favorite PS4 games and add to them with more power for graphics, performance, or features for your 4K HDR TV, or 1080p HD TV. Ready to level up?",
    "price": 400,
    "stock": "6",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/n0eoCfM.png"
  },
  {
    "id": "27",
    "title": "PlayStation 5",
    "description": "Experience lightning-fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers and 3D Audio, and an all-new generation of incredible PlayStation games.",
    "price": 500,
    "stock": "0",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/o1ry0kz.png"
  },
  {
    "id": "28",
    "title": "Nintendo Switch",
    "description": "Nintendo Switch is a console that can transform to suit your situation. Play the way you want, anytime and anywhere.",
    "price": 300,
    "stock": "9",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/HykVFyJ.png"
  },
  {
    "id": "29",
    "title": "Nintendo Switch Lite",
    "description": "Controllers are built right into the system, for a small, lightweight and easy-to-carry Nintendo Switch built especially for handheld play.",
    "price": 220,
    "stock": "6",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/eJnvUGM.png"
  },
  {
    "id": "30",
    "title": "Nintendo Switch OLED Model",
    "description": "The new system features a vibrant 7-inch OLED screen, a wide adjustable stand, a dock with a wired LAN port, 64 GB of internal storage, and enhanced audio.",
    "price": 400,
    "stock": "9",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/Vz3pBBw.png"
  },
  {
    "id": "31",
    "title": "Xbox Series S",
    "description": "Enjoy more dynamic worlds, faster load times, and add Xbox Game Pass Ultimate (membership sold separately) to play new games on day one.",
    "price": 300,
    "stock": "5",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/mblNWdF.png"
  },
  {
    "id": "32",
    "title": "Xbox Series X",
    "description": "Introducing Xbox Series X, the fastest, most powerful Xbox ever. Play thousands of titles from four generations of consoles—all games look and play best on Xbox Series X.",
    "price": 500,
    "stock": "3",
    "category": "consoles",
    "pictureUrl": "https://i.imgur.com/nXR98LU.png"
  },
  {
    "id": "33",
    "title": "Final Fantasy 7 Remake Intergrade",
    "description": "Cloud Strife, an ex-SOLDIER operative, descends on the mako-powered city of Midgar. The world of the timeless classic FINAL FANTASY VII is reborn, using cutting-edge graphics technology, a new battle system and an additional adventure featuring Yuffie Kisaragi.",
    "price": 70,
    "stock": "6",
    "category": "games",
    "pictureUrl": "https://i.imgur.com/HVIdggZ.png"
  }
]
